#pragma once
#include "../../stdafx.h"
#include <array>
#include "../../MiscDefinitions.h"

#define BONE_USED_BY_HITBOX 0x00000100

class CAnimationLayer
{
public:
	float m_flLayerAnimtime; //0
	float m_flLayerFadeOuttime;
	float m_flBlendIn;
	float m_flBlendOut;
	int Unknown1;
	int m_nOrder; //20
	int m_nSequence; //24
	float m_flPrevCycle;
	float m_flWeight; //32
	float m_flWeightDeltaRate;
	float m_flPlaybackRate;
	float m_flCycle; //44
	CBaseEntity *m_pOwner; //48
	int	m_nInvalidatePhysicsBits;
};

class CBaseAnimState
{
public:
	char pad[4];
	char bUnknown; //0x4
	char pad2[91];
	void* pBaseEntity; //0x60
	void* pActiveWeapon; //0x64
	void* pLastActiveWeapon; //0x68
	float m_flLastClientSideAnimationUpdateTime; //0x6C
	int m_iLastClientSideAnimationUpdateFramecount; //0x70
	float m_flEyePitch; //0x74
	float m_flEyeYaw; //0x78
	float m_flPitch; //0x7C
	float m_flGoalFeetYaw; //0x80
	float m_flCurrentFeetYaw; //0x84
	float m_flCurrentTorsoYaw; //0x88
	float m_flUnknownVelocityLean; //0x8C //changes when moving/jumping/hitting ground
	float m_flLeanAmount; //0x90
	char pad4[4]; //NaN
	float m_flFeetCycle; //0x98 0 to 1
	float m_flFeetYawRate; //0x9C 0 to 1
	float m_fUnknown2;
	float m_fDuckAmount; //0xA4
	float m_fLandingDuckAdditiveSomething; //0xA8
	float m_fUnknown3; //0xAC
	Vector m_vOrigin; //0xB0, 0xB4, 0xB8
	Vector m_vLastOrigin; //0xBC, 0xC0, 0xC4
	float m_vVelocityX; //0xC8
	float m_vVelocityY; //0xCC
	char pad5[4];
	float m_flUnknownFloat1; //0xD4 Affected by movement and direction
	char pad6[8];
	float m_flUnknownFloat2; //0xE0 //from -1 to 1 when moving and affected by direction
	float m_flUnknownFloat3; //0xE4 //from -1 to 1 when moving and affected by direction
	float m_unknown; //0xE8
	float speed_2d; //0xEC
	float flUpVelocity; //0xF0
	float m_flSpeedNormalized; //0xF4 //from 0 to 1
	float m_flFeetSpeedForwardsOrSideWays; //0xF8 //from 0 to 2. something  is 1 when walking, 2.something when running, 0.653 when crouch walking
	float m_flFeetSpeedUnknownForwardOrSideways; //0xFC //from 0 to 3. something
	float m_flTimeSinceStartedMoving; //0x100
	float m_flTimeSinceStoppedMoving; //0x104
	unsigned char m_bOnGround; //0x108
	unsigned char m_bInHitGroundAnimation; //0x109
	char pad7[10];
	float m_flLastOriginZ; //0x114
	float m_flHeadHeightOrOffsetFromHittingGroundAnimation; //0x118 from 0 to 1, is 1 when standing
	float m_flStopToFullRunningFraction; //0x11C from 0 to 1, doesnt change when walking or crouching, only running
	char pad8[4]; //NaN
	float m_flUnknownFraction; //0x124 affected while jumping and running, or when just jumping, 0 to 1
	char pad9[4]; //NaN
	float m_flUnknown3;
	char pad10[528];
};

class IHandleEntity;

class CBaseHandle
{
	friend class C_BaseEntityList;
public:
protected:
};
#pragma region randomshit
template< class T >
class CHandle : public CBaseHandle
{
public:
};

#pragma endregion randomshit

struct model_t
{
};

enum class CSGOHitboxID
{
	Head = 0,
	Neck,
	Pelvis,
	Stomach,
	LowerChest,
	Chest,
	UpperChest,
	RightThigh,
	LeftThigh,
	RightShin,
	LeftShin,
	RightFoot,
	LeftFoot,
	RightHand,
	LeftHand,
	RightUpperArm,
	RightLowerArm,
	LeftUpperArm,
	LeftLowerArm,
};

//enum class CSGOHitboxID
//{
//	Head = 6,
//	Neck = 5,
//	NeckLower = 7,
//	Pelvis = 0,
//	Stomach = 68,
//	LowerChest = 3,
//	Chest = 80,
//	UpperChest =35,
//	RightThigh = 74,
//	LeftThigh = 52,
//	RightShin = 71,
//	LeftShin = 64,
//	RightFoot = 72,
//	LeftFoot = 70,
//	RightHand = 60,
//	LeftHand = 2,
//	RightUpperArm = 36,
//	RightLowerArm = 59,
//	LeftUpperArm = 8,
//	LeftLowerArm = 32,
//};

class CCSBomb
{
private:
	template< class T >
	inline T GetFieldValue( int offset )
	{
		return *( T* )( ( DWORD )this + offset );
	}

	template< class T >
	T* GetFieldPointer( int offset )
	{
		return ( T* )( ( DWORD )this + offset );
	}

public:

	/*
	25-Apr-2016
	=========================
	DT_PlantedC4
	|___m_flTimerLength
	|___m_bBombTicking
	|___m_flDefuseCountDown
	|___m_flC4Blow
	|___m_hBombDefuser
	|___m_flDefuseLength
	|___m_bBombDefused
	=========================
	*/
	float GetTimerLength()
	{
		static int m_flTimerLength = Netvar("DT_PlantedC4", "m_flTimerLength");
		return GetFieldValue< float >( m_flTimerLength );
	}

	float GetC4BlowTime()
	{
		static int m_flC4Blow = Netvar("DT_PlantedC4", "m_flC4Blow");
		return GetFieldValue< float >( m_flC4Blow );
	}

	float GetC4DefuseCountDown()
	{
		static int m_flDefuseCountDown = Netvar("DT_PlantedC4", "m_flDefuseCountDown");
		return GetFieldValue< float >( m_flDefuseCountDown );
	}
};

class CBaseEntity;

class CCSWeaponInfo
{
public:
	char _0x0000[20];
	__int32 max_clip;			//0x0014 
	char _0x0018[12];
	__int32 max_reserved_ammo;	//0x0024 
	char _0x0028[96];
	char* hud_name;				//0x0088 
	char* weapon_name;			//0x008C 
	char _0x0090[60];

	__int32 type;				//0x00CC 
	__int32 price;				//0x00D0 
	__int32 reward;				//0x00D4 
	char _0x00D8[20];
	BYTE full_auto;				//0x00EC 
	char _0x00ED[3];
	__int32 damage;				//0x00F0 
	float armor_ratio;			//0x00F4 
	__int32 bullets;			//0x00F8 
	float penetration;			//0x00FC 
	char _0x0100[8];
	float range;				//0x0108 
	float range_modifier;		//0x010C 
	char _0x0110[16];
	BYTE silencer;				//0x0120 
	char _0x0121[15];
	float max_speed;			//0x0130 
	float max_speed_alt;		//0x0134 
	char _0x0138[76];
	__int32 recoil_seed;		//0x0184 
	char _0x0188[32];
};

class IHandleEntity
{
public:
	virtual ~IHandleEntity()
	{
	}

	virtual void SetRefEHandle( const HANDLE& handle ) = 0;

	virtual const HANDLE& GetRefEHandle() const = 0;
};

class IClientUnknown : public IHandleEntity
{
public:
	virtual void* GetCollideable() = 0;

	virtual void* GetClientNetworkable() = 0;

	virtual void* GetClientRenderable() = 0;

	virtual void* GetIClientEntity() = 0;

	virtual void* GetBaseEntity() = 0;

	virtual void* GetClientThinkable() = 0;

	virtual void* GetClientAlphaProperty() = 0;
};

class IClientRenderable
{
public:
	virtual IClientUnknown* GetIClientUnknown() = 0;

	virtual Vector const& GetRenderOrigin( void ) = 0;

	virtual Vector const& GetRenderAngles( void ) = 0;

	virtual bool ShouldDraw( void ) = 0;

	virtual int GetRenderFlags( void ) = 0; // ERENDERFLAGS_xxx
	virtual void Unused( void ) const
	{
	}

	virtual HANDLE GetShadowHandle() const = 0;

	virtual HANDLE& RenderHandle() = 0;

